# Pandas

### 자료구조: Series와 Dataframe
Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재하는데 Series는 시계열과 유사한 데이터로서 index와 value가 존재하고 Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다. 이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.

## Series

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
fruit = Series([2500,3800,1200,6000],
              index=['apple','banana','pear','cherry'])

In [3]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [4]:
print(fruit.values)

[2500 3800 1200 6000]

In [5]:
print(fruit.index)

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

#### 딕셔너리 타입을 시리즈 객체로 만들기

In [6]:
fruitData = {'apple':2500, 'banana':3800, 'pear':1200, 'cherry':6000}
fruit = Series(fruitData)

In [7]:
print(type(fruitData))
print(type(fruit))

<class 'dict'>
<class 'pandas.core.series.Series'>

In [8]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [9]:
fruit.name = 'fruitPrice'
fruit.index.name = 'fruitName'

In [10]:
fruit

fruitName
apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

## Dataframe

In [11]:
fruitData = {'fruitName':['apple','banana','cherry','pear'],
            'fruitPrice':[2500, 3800,6000,1200],
             'num':[10,5,3,8]
            }

In [12]:
fruitFrame = DataFrame(fruitData)

In [13]:
print(fruitFrame)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      pear        1200    8

In [14]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      pear        1200    8

In [15]:
fruitFrame = DataFrame(fruitData, columns=['fruitPrice', 'num', 'fruitName'])

In [16]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      pear

#### 특정한 항목만 뽑기

In [17]:
fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [18]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [19]:
fruitFrame['Year'] = 2022

#### 새로운 컬럼 추가

In [20]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2022
1        3800    5    banana  2022
2        6000    3    cherry  2022
3        1200    8      pear  2022

#### 컬럼에 데이터 변경

In [21]:
fruitFrame['Year'] = 2016

In [22]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      pear  2016

In [23]:
variable = Series([4,2,1],index=[0,2,3])
print(variable)

0    4
2    2
3    1
dtype: int64

In [24]:
fruitFrame['stock'] = variable

In [25]:
print(fruitFrame)

   fruitPrice  num fruitName  Year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      pear  2016    1.0

In [26]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','pear','cherry'])
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [27]:
fruit.drop('banana')

apple     2500
pear      1200
cherry    6000
dtype: int64

In [28]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [29]:
new_fruit = fruit.drop('banana')
print(new_fruit)

apple     2500
pear      1200
cherry    6000
dtype: int64

#### 인덱스를 텍스트로 지정하기

In [30]:
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'pear'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [31]:
fruitName = fruitData['fruitName']
print(fruitName)

['apple', 'banana', 'cherry', 'pear']

In [32]:
fruitFrame = DataFrame(fruitData,
                      index=fruitName,
                      columns=['fruitPrice','num'])
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

### Series와 DataFrame으로 데이터 다루기

In [33]:
fruitFrame2 = fruitFrame.drop(['apple','cherry'])
fruitFrame2

        fruitPrice  num
banana        3800    5
pear          1200    8

In [34]:
fruitFrame3 = fruitFrame.drop('num', axis =1)
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
pear          1200

In [35]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [36]:
fruit['apple':'pear']

apple     2500
banana    3800
pear      1200
dtype: int64

In [37]:
fruit[0:1]

apple    2500
dtype: int64

In [38]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [39]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

### 데이터의 연산

In [40]:
fruit1 = Series([5,9,10,3], index =['apple','banana','cherray','pear'])
fruit2 = Series([3,2,9,5,10], index =['apple','orange','banana','cherray','mango'])

In [41]:
fruit1 + fruit2

apple       8.0
banana     18.0
cherray    15.0
mango       NaN
orange      NaN
pear        NaN
dtype: float64

In [42]:
fruitData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','pear'])
fruitData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango'])

In [43]:
fruitFrame1

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
pear       5      3

In [44]:
fruitFrame2

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [45]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
pear         NaN   NaN    NaN

#### 정렬

In [46]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [47]:
fruit.sort_values()

pear      1200
apple     2500
banana    3800
cherry    6000
dtype: int64

In [48]:
fruit.sort_values(ascending=False)

cherry    6000
banana    3800
apple     2500
pear      1200
dtype: int64

In [49]:
fruit.sort_index()

apple     2500
banana    3800
cherry    6000
pear      1200
dtype: int64

In [50]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [51]:
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [52]:
fruitFrame.sort_values(by=['fruitPrice'])

        fruitPrice  num
pear          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3

In [53]:
fruitFrame.sort_values(by=['fruitPrice','num'])

        fruitPrice  num
pear          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3

### csv 데이터 분석하기

In [54]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')

In [55]:
german

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0,1,24,2,3,1987,1,3,2,3,...,4,1,21,3,1,1,2,2,1,1
996,0,1,24,2,0,2303,1,5,4,3,...,1,1,45,3,2,1,3,1,1,1
997,0,4,21,4,0,12680,5,5,4,3,...,4,4,30,3,3,1,4,1,2,1
998,0,2,12,2,3,6468,5,1,2,3,...,1,4,52,3,2,1,4,1,2,1
999,0,1,30,2,2,6350,5,5,4,3,...,4,2,31,3,2,1,3,1,1,1

In [56]:
german.columns.values

array(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'], dtype=object)

In [57]:
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [58]:
german_sample = german[['Creditability','Duration of Credit (month)','Purpose', 'Credit Amount']]

In [59]:
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [60]:
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [61]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [62]:
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [63]:
german_sample.describe

<bound method NDFrame.describe of      Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]>

In [64]:
german_sample = german[['Duration of Credit (month)','Credit Amount','Age (years)']]

In [65]:
german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [66]:
german_sample = german[['Credit Amount','Type of apartment']]

In [67]:
german_sample

     Credit Amount  Type of apartment
0             1049                  1
1             2799                  1
2              841                  1
3             2122                  1
4             2171                  2
..             ...                ...
995           1987                  1
996           2303                  2
997          12680                  3
998           6468                  2
999           6350                  2

[1000 rows x 2 columns]

In [68]:
german_grouped = german_sample['Credit Amount']
german_grouped

0       1049
1       2799
2        841
3       2122
4       2171
       ...
995     1987
996     2303
997    12680
998     6468
999     6350
Name: Credit Amount, Length: 1000, dtype: int64

In [69]:
german_grouped = german_sample['Credit Amount'].groupby(german_sample['Type of apartment'])
german_grouped

In [70]:
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [71]:
german_sample = german[['Credit Amount','Type of apartment','Purpose']]

In [72]:
german_grouped = german_sample['Credit Amount'].groupby(
                                                    [german_sample['Purpose'],
                                                     german_sample['Type of apartment']])
german_grouped

In [73]:
german_grouped.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64